In [ ]:
# nama = "hello world üò§üëç"
# print(nama)

In [ ]:
import pandas as pd

In [50]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], columns=["Kolom A", " Kolom B", " Kolom C"])
df.head()

   Kolom A   Kolom B   Kolom C
0        1         2         3
1        4         5         6
2        7         8         9

In [49]:
df = pd.DataFrame({
    "No": [1, 2, 3, 4],
    "Nama": ["Nauval", "Adrian", "Afrand", "Yusuf"],
    "Umur": [20, 16, 16, 16]
})

df.head()
# df.iloc[[0,1]]

   No    Nama  Umur
0   1  Nauval    20
1   2  Adrian    16
2   3  Afrand    16
3   4   Yusuf    16

In [ ]:
df = pd.DataFrame([["Ayam Goreng"], ["Rendang"], ["Sop sapi"], ["Nasi goreng"], ["Ayam Kremes"]], columns=["Menu Makanan"])
df.head()

In [47]:
df = pd.DataFrame([["Ayam Goreng", "Sop sapi" ], ["Ayam Kremes", "Nasi gudeg"]], columns=["Menu 1", "Menu 2"])
df.head()

        Menu 1      Menu 2
0  Ayam Goreng    Sop sapi
1  Ayam Kremes  Nasi gudeg

In [ ]:
df = pd.DataFrame({
    "No": [1, 2, 3,],
    "Nama Makanan": ["Ayam Goreng", "Ayam Penyet", "Nasi Goreng"],
    "Harga": [10000, 20000, 300000]
})

df.head()
# ini masuk kedalam array 2 dimensi
# kenapa masuk kedalam array 2 dimensi? silahkan dicari sendiri jawabannya

   No Nama Makanan   Harga
0   1  Ayam Goreng   10000
1   2  Ayam Penyet   20000
2   3  Nasi Goreng  300000